Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH01/edc/PIC32CM2532JH01048.PIC
      <edc:SFRDef edc:_addr="0x42001C58" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ILS" edc:impl="0x3FFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="RF0NL" edc:desc="Rx FIFO 0 New Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0WL" edc:desc="Rx FIFO 0 Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0FL" edc:desc="Rx FIFO 0 Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0LL" edc:desc="Rx FIFO 0 Message Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1NL" edc:desc="Rx FIFO 1 New Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1WL" edc:desc="Rx FIFO 1 Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1FL" edc:desc="Rx FIFO 1 FIFO Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1LL" edc:desc="Rx FIFO 1 Message Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPML" edc:desc="High Priority Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCL" edc:desc="Timestamp Completed Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCFL" edc:desc="Transmission Cancellation Finished Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFEL" edc:desc="Tx FIFO Empty Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFNL" edc:desc="Tx Event FIFO New Entry Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFWL" edc:desc="Tx Event FIFO Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFL" edc:desc="Tx Event FIFO Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFLL" edc:desc="Tx Event FIFO Element Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSWL" edc:desc="Timestamp Wraparound Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MRAFL" edc:desc="Message RAM Access Failure Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TOOL" edc:desc="Timeout Occurred Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRXL" edc:desc="Message stored to Dedicated Rx Buffer Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BECL" edc:desc="Bit Error Corrected Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BEUL" edc:desc="Bit Error Uncorrected Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ELOL" edc:desc="Error Logging Overflow Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPL" edc:desc="Error Passive Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWL" edc:desc="Warning Status Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOL" edc:desc="Bus_Off Status Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDIL" edc:desc="Watchdog Interrupt Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEAL" edc:desc="Protocol Error in Arbitration Phase Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEDL" edc:desc="Protocol Error in Data Phase Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARAL" edc:desc="Access to Reserved Address Line" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001C5C" edc:access="------------------------------nn" edc:cname="ILE" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EINT0" edc:desc="Enable Interrupt Line 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EINT1" edc:desc="Enable Interrupt Line 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42001C60" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x42001C80" edc:access="--------------------------nnnnnn" edc:cname="GFC" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="RRFE" edc:desc="Reject Remote Frames Extended" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RRFS" edc:desc="Reject Remote Frames Standard" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANFE" edc:desc="Accept Non-matching Frames Extended" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RXF0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RXF1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ANFS" edc:desc="Accept Non-matching Frames Standard" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RXF0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RXF1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001C84" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SIDFC" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="FLSSA" edc:desc="Filter List Standard Start Address" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="LSS" edc:desc="List Size Standard" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001C88" edc:access="---------nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XIDFC" edc:impl="0x7FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="FLESA" edc:desc="Filter List Extended Start Address" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="LSE" edc:desc="List Size Extended" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42001C8C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x42001C90" edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XIDAM" edc:impl="0x1FFFFFFF" edc:mclr="00011111111111111111111111111111" edc:nzwidth="0x20" edc:por="00011111111111111111111111111111" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EIDM" edc:desc="Extended ID Mask" edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
